gzehentner/ESP32_Projects/Wasserstand_ESP_V05/src/server.cpp
  // print when a new value arrieves
  message += F("<br><br>  Zeit: ");
  message += formattedTime;
  message += F("   Wasserstand aktuell: ");
  message += myValueFilteredAct;

  message += F("</article>");

  message += F("<article>\n"
  "<h2>Simulation</h2>\n" 
  "<p>Zum Einschalten der Simulation klicke auf den obersten Schalter "
  "<br>rot : Debug ein"
  "<br><br>Um die Relais Eingänge zu schalten, klicke auf den entsprechenden Schalter<br>"
  "<br>AHH / AH / AL : rot  --> überschritten"
  "<br>AHH / AH / AL : grün --> unterschritten"
  "</p>");
  if (debugLevelSwitches == 1) // simulation aktiv = rot
  {
    message += F("<p class='on'><a href='c.php?toggle=a' target='i'>Debug</a></p>\n");
  } else {
    message += F("<p class='off'><a href='c.php?toggle=a' target='i'>Debug</a></p>\n");
  }
  if (simVal_AHH == 0)  // low active => 0 = on = rot
  {
  message += F("<p class='on'><a href='c.php?toggle=1' target='i'>AHH</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=1' target='i'>AHH</a></p>\n");
  }
  if (simVal_AH == 0) // low active
  {
  message += F("<p class='on'><a href='c.php?toggle=2' target='i'>AH</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=2' target='i'>AH</a></p>\n");
  }
  if (simVal_AL == 1)  // high active => 1 = on = rot
  {
  message += F("<p class='on'><a href='c.php?toggle=3' target='i'>AL</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=3' target='i'>AL</a></p>\n");
  }
  // if (simVal_ALL) 
  // {
  // message += F("<p class='on'><a href='c.php?toggle=4' target='i'>ALL</a></p>\n");
  // } else {
  // message += F("<p class='off'><a href='c.php?toggle=4' target='i'>ALL</a></p>\n");
  // }
  message += F("<p class='off'><a href='c.php?toggle=5' target='i'>LED</a></p>\n"
  "<iframe name='i' style='display:none' ></iframe>\n" // hack to keep the button press in the window
  "</article>\n");

  addBottom(message);
  server.send(200, "text/html", message);
}


/* =======================================*/
/* print value history*/
void handleListFiltered()
/* =======================================*/
{
  // what string length do we need?
  //   listing shortterm 
  //   - per line 25
  //   - 100 lines
  //   listing longterm
  //   - per line 25
  //   - 120 lines
  //  sum: 550 character without header and footer
  // 1 - message length: 513
  // 2 - message length: 3909
  
  String message = "";
  message.reserve(35000);

  String formattedTimeL= "";
  String formattedDateL= "";

  int iLine = iRingValueMax;

  addTop(message);

  Serial.print("1 - message length: "); 
  Serial.println(message.length());

  //---------------------
  // shortterm values
  //---------------------
  message += F("<article>"
               "<h2>Wasserstand Zehentner Teisendorf</h2>" 
               "<p>Shortterm values<br>Index ");
  message += filterCnt;             
  message += "<br> </p>";

  // create header of table
  message += "<pre>rdRingPtr  Time     Value ADC <br>";
  
  // read out ringbuffer and display values, but not more than maxLines lines
  for ( rdRingPtr = wrRingPtr+1; (rdRingPtr != wrRingPtr); ){
    // print only the last lines
    if (iLine <= maxLines) {
      message += rdRingPtr;
      message += "       ";

      formatDateAndTime(formattedTimeL, formattedDateL, ringTime[rdRingPtr]);
      message += formattedTimeL;

      message += "  ";
      message += ringValue[rdRingPtr];
      message += "  ";
      message += ringADC[rdRingPtr];
      message += "<br>";
      
    }

    if (rdRingPtr<iRingValueMax) {
      rdRingPtr++;
    } else {
      rdRingPtr = 0;
    }
    iLine--;
    
  }
  message += F("</pre></article>");

  //---------------------
  // longterm values
  //---------------------
  message += F("<article>"
              "<h2>Wasserstand Zehentner Teisendorf</h2>" 
              "<p>Longtterm values<br>Index ");
  message += filterCnt;             
  message += "<br> </p>";

  // create header of table
  message += "<pre>rdRingPtr  Time     Value <br>";
  
  // read out ringbuffer and display values, but not more than maxLines lines
  iLine = iLongtermRingValueMax;
  for ( rdLongtermRingPtr = wrLongtermRingPtr+1; (rdLongtermRingPtr != wrLongtermRingPtr); ){

    // print only the last lines
    if (iLine <= maxLines) {
      message += rdLongtermRingPtr;
      message += "       ";
      
      formatDateAndTime(formattedTimeL, formattedDateL, ringLongtermTime[rdLongtermRingPtr]);
      message += formattedTimeL;
      
      message += "  ";
      message += ringLongtermValue[rdLongtermRingPtr];
       message += "<br>";
    }
    if (rdLongtermRingPtr<iLongtermRingValueMax) {
      rdLongtermRingPtr++;
    } else {
      rdLongtermRingPtr = 0;
    }
    iLine--;

  }
  message += F("</pre></article><br>");

  addBottom(message);
  server.send(200, "text/html", message);
  
  Serial.print("2 - message length: "); 
  Serial.println(message.length());
}
/* =======================================*/
/* print both graph longterm and shortterm*/
void handleGraph()
/* =======================================*/
{
  String graphXValues = "";     // values for graph (displayed)
  graphXValues.reserve(13000);

  String graphYValues = "";
  graphYValues.reserve(4000);

  String formattedTimeL= "";
  String formattedDateL= "";

  int noValues = 0;
  int iPoint = iRingValueMax;

  // prepare values for graph
  graphXValues  = "const xValues = [";
  graphYValues  = "const yValues = [";


  // read out ringbuffer and create the vector to display as graph
  for ( rdRingPtr = wrRingPtr+1; rdRingPtr != wrRingPtr; ){
    
    // if there is a valid time set (time="" means there is no value written since last startup)
    if (ringTime[rdRingPtr] != 0) {
      if (iPoint <= maxPoints) {
        // fill X values time
        graphXValues += "\"";
        formatDateAndTime(formattedTimeL, formattedDateL, ringTime[rdRingPtr]);
        graphXValues += formattedTimeL;

        graphXValues += "\", ";
        // take value and place it to the string for graph
        graphYValues += ringValue[rdRingPtr];
        graphYValues += ", ";
        noValues ++;
      }
    }
    if (rdRingPtr<iRingValueMax) {
      rdRingPtr++;
    } else {
      rdRingPtr = 0;
    }
    iPoint--;  
    }
  
    // enclose the generated strings with necessary brakets
    firstRun = 0;
    graphXValues += "];";
    graphYValues += "];";

    Serial.print("graphXValues: "); 
    Serial.println(graphXValues.length());
    Serial.print("graphYValues: "); 
    Serial.println(graphYValues.length());


  String message;
  message.reserve(20000);
  addTop(message);


  message += F("<article>"
               "<h2>Wasserstand Zehentner Teisendorf</h2>" 
               "<p>Line Graph -- Shortterm values<br> </p> "); 

  message += "<br>filterCnt= ";
  message += filterCnt;

  // print when a new value arrives
  message += F("<br><br>  Zeit: ");
  message += formattedTime;
  message += F("   Wasserstand aktuell: ");
  message += myValueFilteredAct;
  message += "</article>";

