gzehentner/ESP32_Projects/Wasserstand_ESP_V05/src/server.cpp
  message += "<script"
               " src=\"https://cdnjs.cloudflare.com/ajax/libs/Chart.js/2.9.4/Chart.js\">"
               "</script>";
  
  message += "<body><canvas id=\"Shortterm_chart\" style=\"width:100%;max-width:700px\"></canvas>";
  
  message += "<script>";
  message += graphXValues; 
  message += graphYValues; 

  message += "const graphYlevelWarn = [];";
  message += "generateWarnData(\"";
  message += Level_AH*10;
  message += "\",0,";
  message += noValues;
  message +=",1);";

  message += "const graphYlevelErro = [];";
  message += "generateErroData(\"";
  message += Level_AHH*10;
  message += "\",0,";
  message += noValues;
  message +=",1);";
  

  message +=  "new Chart(\"Shortterm_chart\", {";
  message +=  " type: \"line\",";
  message +=  " data: {";
  message +=  "   labels: xValues,";
  message +=  "   datasets: [{";
  message +=  "     fill: false,";
  message +=  "     lineTension: 1,";
  message +=  "     pointRadius: 1,";
  message +=  "     backgroundColor: \"rgba(0,0,255,1.0)\",";
  message +=  "     borderColor: \"rgba(0,0,255,0.5)\",";
  message +=  "     label: \"Wasserstand [mm]\",";
  message +=  "     data: yValues";
  message +=  "     },{";
  message +=  "     fill: false,";
  message +=  "     lineTension: 0,";
  message +=  "     pointRadius: 0,";
  message +=  "     backgroundColor: \"rgba(0,255,0,0)\",";
  message +=  "     borderColor: \"rgba(0,255,0,0.3)\",";
  message +=  "     label: \"Warnschwelle: ";
  message +=  Level_AH;
  message +=  "0 mm\",";
  message +=  "     data: graphYlevelWarn";
  message +=  "     },{";
  message +=  "     fill: false,";
  message +=  "     lineTension: 0,";
  message +=  "     pointRadius: 0,";
  message +=  "     backgroundColor: \"rgba(255,0,0,0)\",";
  message +=  "     borderColor: \"rgba(255,0,0,0.3)\",";
  message +=  "     label: \"Alarmschwelle: ";
  message +=  Level_AHH;
  message +=  "0 mm\",";
  message +=  "     data: graphYlevelErro";
  message +=  "   }]";
  message +=  " },";
  message +=  " options: {";
  message +=  "   title: {";
  message +=  "   display: false,";
  message +=  "   text: \"Wasserstand in mm\"";
  message +=  "   },";
  message +=  "   legend: {display: true, text: \"Wasserstand \"},";
  message +=  "   scales: {";
  message +=  "     yAxes: [{ticks: {min: 1000, max:2000}}]";
  message +=  "   }";
  message +=  " }";
  message +=  " });";
  message +=  " function generateWarnData(value, i1, i2, step = 1) {";
  message +=  "     for (let x = i1; x <= i2; x += step) {";
  message +=  "       ;";
  message +=  "       graphYlevelWarn.push(eval(value));";
  message +=  "     }";
  message +=  "   }";
  message +=  " function generateErroData(value, i1, i2, step = 1) {";
  message +=  "     for (let x = i1; x <= i2; x += step) {";
  message +=  "       ;";
  message +=  "       graphYlevelErro.push(eval(value));";
  message +=  "     }";
  message +=  "   }";
  message +=  "</script></body>";
            
  addBottom(message);

  Serial.print("message: "); 
  Serial.println(message.length());

  server.send(200, "text/html", message);


  graphXValues = "";                     // erase all values
  graphYValues = "";
    
}

/* =======================================*/
/* print graph longterm*/
void handleLongtermGraph()

/* =======================================*/
{
  String graphLongtermXValues = "";     // values for graph (displayed)
  graphLongtermXValues.reserve(2000);

  String graphLongtermYValues = "";
  graphLongtermYValues.reserve(500);

  String formattedTimeL= "";
  String formattedDateL= "";

  int noValues = 0;
  int iPoint = iLongtermRingValueMax;

  // prepare values for graph
  graphLongtermXValues  = "const xValues = [";
  graphLongtermYValues  = "const yValues = [";


  // read out ringbuffer and create the vector to display as graph
  for ( rdLongtermRingPtr = wrLongtermRingPtr+1; rdLongtermRingPtr != wrLongtermRingPtr; ){
    
    // if there is a valid time set (time="" means there is no value written since last startup)
    if (ringLongtermTime[rdLongtermRingPtr] != 0) {
      if (iPoint <= maxPoints) {

        // fill X values time
        graphLongtermXValues += "\"";

        formatDateAndTime(formattedTimeL, formattedDateL, ringLongtermTime[rdLongtermRingPtr]);
        graphLongtermXValues += formattedTimeL;

        graphLongtermXValues += "\", ";
        // take value and place it to the string for graph
        graphLongtermYValues += ringLongtermValue[rdLongtermRingPtr];
        graphLongtermYValues += ", ";
        noValues ++;
      }   
    }
    if (rdLongtermRingPtr<iLongtermRingValueMax) {
      rdLongtermRingPtr++;
    } else {
      rdLongtermRingPtr = 0;
    }
    iPoint--;  

    }
  
    // enclose the generated strings with necessary brakets
    firstRun = 0;
    graphLongtermXValues += "];";
    graphLongtermYValues += "];";

  Serial.print("graphLongtermXValues: "); 
  Serial.println(graphLongtermXValues.length());
  Serial.print("graphLongtermYValues: "); 
  Serial.println(graphLongtermYValues.length());


  
  String message;
  message.reserve(5000);

  addTop(message);


  message += F("<article>"
               "<h2>Wasserstand Zehentner Teisendorf</h2>" 
               "<p>Line Graph<br> - Longterm values </p> "); 

  message += "<br>filterCnt= ";
  message += filterCnt;

  // print when a new value arrives
  message += F("<br><br>  Zeit: ");
  message += formattedTime;
  message += F("   Wasserstand aktuell: ");
  message += myValueFilteredAct;
  message += "</article>";

  message += "<script"
               " src=\"https://cdnjs.cloudflare.com/ajax/libs/Chart.js/2.9.4/Chart.js\">"
               "</script>";
  
  /* handle longterm */
  message += "<body><canvas id=\"Longterm_chart\" style=\"width:100%;max-width:700px\"></canvas>";

  message += "<script>";
  message += graphLongtermXValues; 
  message += graphLongtermYValues; 
  
  message += "const graphYlevelWarn = [];";
  message += "generateWarnData(\"";
  message += Level_AH*10;
  message += "\",0,";
  message += noValues;
  message +=",1);";

  message += "const graphYlevelErro = [];";
  message += "generateErroData(\"";
  message += Level_AHH*10;
  message += "\",0,";
  message += noValues;
  message +=",1);";
  

  message +=  "new Chart(\"Longterm_chart\", {";
  message +=  " type: \"line\",";
  message +=  " data: {";
  message +=  "   labels: xValues,";
  message +=  "   datasets: [{";
  message +=  "     fill: false,";
  message +=  "     lineTension: 1,";
  message +=  "     pointRadius: 2,";
  message +=  "     backgroundColor: \"rgba(0,0,255,1.0)\",";
  message +=  "     borderColor: \"rgba(0,0,255,0.5)\",";
  message +=  "     label: \"Wasserstand [mm]\",";
  message +=  "     data: yValues";
  message +=  "     },{";
  message +=  "     fill: false,";
  message +=  "     lineTension: 0,";
  message +=  "     pointRadius: 0,";
  message +=  "     backgroundColor: \"rgba(0,255,0,0)\",";
  message +=  "     borderColor: \"rgba(0,255,0,0.3)\",";
  message +=  "     label: \"Warnschwelle: ";
  message +=  Level_AH;
  message +=  "0 mm\",";
  message +=  "     data: graphYlevelWarn";
  message +=  "     },{";
  message +=  "     fill: false,";
  message +=  "     lineTension: 0,";
  message +=  "     pointRadius: 0,";
  message +=  "     backgroundColor: \"rgba(255,0,0,0)\",";
  message +=  "     borderColor: \"rgba(255,0,0,0.3)\",";
  message +=  "     label: \"Alarmschwelle: ";
  message +=  Level_AHH;
  message +=  "0 mm\",";
  message +=  "     data: graphYlevelErro";
  message +=  "   }]";
  message +=  " },";
  message +=  " options: {";
  message +=  "   title: {";
  message +=  "   display: false,";
  message +=  "   text: \"Wasserstand in mm\"";
  message +=  "   },";
  message +=  "   legend: {display: true, text: \"Wasserstand \"},";
  message +=  "   scales: {";
  message +=  "     yAxes: [{ticks: {min: 1000, max:2000}}]";
  message +=  "   }";
  message +=  " }";
  message +=  " });";
  message +=  " function generateWarnData(value, i1, i2, step = 1) {";
  message +=  "     for (let x = i1; x <= i2; x += step) {";
  message +=  "       ;";
  message +=  "       graphYlevelWarn.push(eval(value));";
  message +=  "     }";
  message +=  "   }";
  message +=  " function generateErroData(value, i1, i2, step = 1) {";
  message +=  "     for (let x = i1; x <= i2; x += step) {";
  message +=  "       ;";
  message +=  "       graphYlevelErro.push(eval(value));";
  message +=  "     }";
  message +=  "   }";
  message +=  "</script></body>";

  addBottom(message);

  Serial.print("message: "); 
  Serial.println(message.length());

  server.send(200, "text/html", message);
  
  graphLongtermXValues = "";                     // erase all values
  graphLongtermYValues = "";

